Autodesk.Revit.DB.IntegerRange.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.IntegerRange.High
The upper limit of the range
Since:
2015

Autodesk.Revit.DB.IntegerRange.Low
The lower limit of the range
Since:
2015

Autodesk.Revit.DB.IntegerRange
A class to define a range of a sequence of consecutive integer numbers
Since:
2015